donginhb/yeejoin-workspace/light-300/rs485-sw/os-app/bsp/stm32f10x/sdcard.c
	if (NULL == readbuff) {
		errorstatus = SD_INVALID_PARAMETER;
		return(errorstatus);
	}

	TransferError = SD_OK;
	TransferEnd = 0;
	TotalNumberOfBytes = 0;

	/* Clear all DPSM configuration */
	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
	SDIO_DataInitStructure.SDIO_DataLength = 0;
	SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_1b;
	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Disable;
	SDIO_DataConfig(&SDIO_DataInitStructure);
	SDIO_DMACmd(DISABLE);

	if (SDIO_GetResponse(SDIO_RESP1) & SD_CARD_LOCKED) {
		errorstatus = SD_LOCK_UNLOCK_FAILED;
		return(errorstatus);
	}

	if (CardType == SDIO_HIGH_CAPACITY_SD_CARD) {
		BlockSize = 512;
		addr /= 512;
	}
	if ((BlockSize > 0) && (BlockSize <= 2048) && ((BlockSize & (BlockSize - 1)) == 0)) {
		power = convert_from_bytes_to_power_of_two(BlockSize);

		/* Set Block Size for Card */
		SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) BlockSize;
		SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SET_BLOCKLEN;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommand(&SDIO_CmdInitStructure);

		errorstatus = CmdResp1Error(SDIO_SET_BLOCKLEN);

		if (SD_OK != errorstatus) {
			return(errorstatus);
		}
	} else {
		errorstatus = SD_INVALID_PARAMETER;
		return(errorstatus);
	}

	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
	SDIO_DataInitStructure.SDIO_DataLength = BlockSize;
	SDIO_DataInitStructure.SDIO_DataBlockSize = (uint32_t) power << 4;
	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
	SDIO_DataConfig(&SDIO_DataInitStructure);

	TotalNumberOfBytes = BlockSize;
	StopCondition = 0;
	DestBuffer = readbuff;

	/* Send CMD17 READ_SINGLE_BLOCK */
	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t)addr;
	SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_READ_SINGLE_BLOCK;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommand(&SDIO_CmdInitStructure);

	errorstatus = CmdResp1Error(SDIO_READ_SINGLE_BLOCK);

	if (errorstatus != SD_OK) {
		return(errorstatus);
	}
	/* In case of single block transfer, no need of stop transfer at all.*/
	if (DeviceMode == SD_POLLING_MODE) {
		/* Polling mode */
		while (!(SDIO->STA &(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR))) {
			if (SDIO_GetFlagStatus(SDIO_FLAG_RXFIFOHF) != RESET) {
				for (count = 0; count < 8; count++) {
					*(tempbuff + count) = SDIO_ReadData();
				}
				tempbuff += 8;
			}
		}

		if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET) {
			SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
			errorstatus = SD_DATA_TIMEOUT;
			return(errorstatus);
		} else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET) {
			SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
			errorstatus = SD_DATA_CRC_FAIL;
			return(errorstatus);
		} else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET) {
			SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
			errorstatus = SD_RX_OVERRUN;
			return(errorstatus);
		} else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET) {
			SDIO_ClearFlag(SDIO_FLAG_STBITERR);
			errorstatus = SD_START_BIT_ERR;
			return(errorstatus);
		}
		while (SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET) {
			*tempbuff = SDIO_ReadData();
			tempbuff++;
		}

		/* Clear all the static flags */
		SDIO_ClearFlag(SDIO_STATIC_FLAGS);
	} else if (DeviceMode == SD_INTERRUPT_MODE) {
		SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_RXFIFOHF | SDIO_IT_STBITERR, ENABLE);
		while ((TransferEnd == 0) && (TransferError == SD_OK)) {
		}
		if (TransferError != SD_OK) {
			return(TransferError);
		}
	} else if (DeviceMode == SD_DMA_MODE) {
		rt_tick_t tick;

		SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
		SDIO_DMACmd(ENABLE);
		tick = rt_tick_get();
		DMA_RxConfiguration(readbuff, BlockSize);
		while (DMA_GetFlagStatus(DMA2_FLAG_TC4) == RESET) {
			if ((TransferError != SD_OK) || (rt_tick_get() - tick > 10)) {
				errorstatus = SD_ERROR;
				// rt_kprintf("sd error\n");
				break;
			}
		}
	}
	return(errorstatus);
}

/**
  * @brief  Allows to read blocks from a specified address  in a card.
  * @param  addr: Address from where data are to be read.
  * @param  readbuff: pointer to the buffer that will contain the
  *   received data.
  * @param  BlockSize: the SD card Data block size.
  * @param  NumberOfBlocks: number of blocks to be read.
  * @retval SD_Error: SD Card Error code.
  */
SD_Error SD_ReadMultiBlocks(uint32_t addr, uint32_t *readbuff, uint16_t BlockSize, uint32_t NumberOfBlocks)
{
	SD_Error errorstatus = SD_OK;
	uint32_t count = 0, *tempbuff = readbuff;
	uint8_t power = 0;

	if (NULL == readbuff) {
		errorstatus = SD_INVALID_PARAMETER;
		return(errorstatus);
	}

	TransferError = SD_OK;
	TransferEnd = 0;
	TotalNumberOfBytes = 0;

	/* Clear all DPSM configuration */
	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
	SDIO_DataInitStructure.SDIO_DataLength = 0;
	SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_1b;
	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Disable;
	SDIO_DataConfig(&SDIO_DataInitStructure);
	SDIO_DMACmd(DISABLE);

	if (SDIO_GetResponse(SDIO_RESP1) & SD_CARD_LOCKED) {
		errorstatus = SD_LOCK_UNLOCK_FAILED;
		return(errorstatus);
	}

	if (CardType == SDIO_HIGH_CAPACITY_SD_CARD) {
		BlockSize = 512;
		addr /= 512;
	}

	if ((BlockSize > 0) && (BlockSize <= 2048) && (0 == (BlockSize & (BlockSize - 1)))) {
		power = convert_from_bytes_to_power_of_two(BlockSize);

		/* Set Block Size for Card */
		SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) BlockSize;
		SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SET_BLOCKLEN;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommand(&SDIO_CmdInitStructure);

		errorstatus = CmdResp1Error(SDIO_SET_BLOCKLEN);

