donginhb/yeejoin-workspace/light-300/rs485-sw/os-app/bsp/stm32f10x/sdcard.c
	if (writebuff == NULL) {
		errorstatus = SD_INVALID_PARAMETER;
		return(errorstatus);
	}

	TransferError = SD_OK;
	TransferEnd = 0;
	TotalNumberOfBytes = 0;

	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
	SDIO_DataInitStructure.SDIO_DataLength = 0;
	SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_1b;
	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Disable;
	SDIO_DataConfig(&SDIO_DataInitStructure);
	SDIO_DMACmd(DISABLE);

	if (SDIO_GetResponse(SDIO_RESP1) & SD_CARD_LOCKED) {
		errorstatus = SD_LOCK_UNLOCK_FAILED;
		return(errorstatus);
	}

	if (CardType == SDIO_HIGH_CAPACITY_SD_CARD) {
		BlockSize = 512;
		addr /= 512;
	}

	/* Set the block size, both on controller and card */
	if ((BlockSize > 0) && (BlockSize <= 2048) && ((BlockSize & (BlockSize - 1)) == 0)) {
		power = convert_from_bytes_to_power_of_two(BlockSize);

		SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) BlockSize;
		SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SET_BLOCKLEN;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommand(&SDIO_CmdInitStructure);

		errorstatus = CmdResp1Error(SDIO_SET_BLOCKLEN);

		if (errorstatus != SD_OK) {
			return(errorstatus);
		}
	} else {
		errorstatus = SD_INVALID_PARAMETER;
		return(errorstatus);
	}

	/* Wait till card is ready for data Added */
	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) (RCA << 16);
	SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SEND_STATUS;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommand(&SDIO_CmdInitStructure);

	errorstatus = CmdResp1Error(SDIO_SEND_STATUS);

	if (errorstatus != SD_OK) {
		return(errorstatus);
	}

	if (NumberOfBlocks > 1) {
		/* Common to all modes */
		if (NumberOfBlocks * BlockSize > SD_MAX_DATA_LENGTH) {
			errorstatus = SD_INVALID_PARAMETER;
			return(errorstatus);
		}

		if ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == CardType) || (SDIO_STD_CAPACITY_SD_CARD_V2_0 == CardType) || (SDIO_HIGH_CAPACITY_SD_CARD == CardType)) {
			/* To improve performance */
			SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) (RCA << 16);
			SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_APP_CMD;
			SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
			SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
			SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
			SDIO_SendCommand(&SDIO_CmdInitStructure);


			errorstatus = CmdResp1Error(SDIO_APP_CMD);

			if (errorstatus != SD_OK) {
				return(errorstatus);
			}
			/* To improve performance */
			SDIO_CmdInitStructure.SDIO_Argument = (uint32_t)NumberOfBlocks;
			SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SET_BLOCK_COUNT;
			SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
			SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
			SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
			SDIO_SendCommand(&SDIO_CmdInitStructure);

			errorstatus = CmdResp1Error(SDIO_SET_BLOCK_COUNT);

			if (errorstatus != SD_OK) {
				return(errorstatus);
			}
		}

		/* Send CMD25 WRITE_MULT_BLOCK with argument data address */
		SDIO_CmdInitStructure.SDIO_Argument = (uint32_t)addr;
		SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_WRITE_MULT_BLOCK;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommand(&SDIO_CmdInitStructure);

		errorstatus = CmdResp1Error(SDIO_WRITE_MULT_BLOCK);

		if (SD_OK != errorstatus) {
			return(errorstatus);
		}

		TotalNumberOfBytes = NumberOfBlocks * BlockSize;
		StopCondition = 1;
		SrcBuffer = writebuff;

		SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
		SDIO_DataInitStructure.SDIO_DataLength = NumberOfBlocks * BlockSize;
		SDIO_DataInitStructure.SDIO_DataBlockSize = (uint32_t) power << 4;
		SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
		SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
		SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
		SDIO_DataConfig(&SDIO_DataInitStructure);

		if (DeviceMode == SD_POLLING_MODE) {
			while (!(SDIO->STA & (SDIO_FLAG_TXUNDERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DATAEND | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_STBITERR))) {
				if (SDIO_GetFlagStatus(SDIO_FLAG_TXFIFOHE) != RESET) {
					if (!((TotalNumberOfBytes - bytestransferred) < SD_HALFFIFOBYTES)) {
						for (count = 0; count < SD_HALFFIFO; count++) {
							SDIO_WriteData(*(tempbuff + count));
						}
						tempbuff += SD_HALFFIFO;
						bytestransferred += SD_HALFFIFOBYTES;
					} else {
						restwords = ((TotalNumberOfBytes - bytestransferred) % 4 == 0) ? ((TotalNumberOfBytes - bytestransferred) / 4) :
									((TotalNumberOfBytes - bytestransferred) / 4 + 1);

						for (count = 0; count < restwords; count++, tempbuff++, bytestransferred += 4) {
							SDIO_WriteData(*tempbuff);
						}
					}
				}
			}

			if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET) {
				SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
				errorstatus = SD_DATA_TIMEOUT;
				return(errorstatus);
			} else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET) {
				SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
				errorstatus = SD_DATA_CRC_FAIL;
				return(errorstatus);
			} else if (SDIO_GetFlagStatus(SDIO_FLAG_TXUNDERR) != RESET) {
				SDIO_ClearFlag(SDIO_FLAG_TXUNDERR);
				errorstatus = SD_TX_UNDERRUN;
				return(errorstatus);
			} else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET) {
				SDIO_ClearFlag(SDIO_FLAG_STBITERR);
				errorstatus = SD_START_BIT_ERR;
				return(errorstatus);
			}

			if (SDIO_GetFlagStatus(SDIO_FLAG_DATAEND) != RESET) {
				if ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == CardType) || (SDIO_STD_CAPACITY_SD_CARD_V2_0 == CardType) || (SDIO_HIGH_CAPACITY_SD_CARD == CardType)) {
					/* Send CMD12 STOP_TRANSMISSION */
					SDIO_CmdInitStructure.SDIO_Argument = 0x0;
					SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_STOP_TRANSMISSION;
					SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
					SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
					SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
					SDIO_SendCommand(&SDIO_CmdInitStructure);


					errorstatus = CmdResp1Error(SDIO_STOP_TRANSMISSION);

