donginhb/yeejoin-workspace/light-300/rs485-sw/os-app/bsp/stm32f10x/sdcard.c
	if (errorstatus != SD_OK) {
		return(errorstatus);
	}

	*pcardstatus = SDIO_GetResponse(SDIO_RESP1);

	return(errorstatus);
}

/**
  * @brief  Returns the current SD card's status.
  * @param  psdstatus: pointer to the buffer that will contain the SD
  *   card status (SD Status register).
  * @retval SD_Error: SD Card Error code.
  */
SD_Error SD_SendSDStatus(uint32_t *psdstatus)
{
	SD_Error errorstatus = SD_OK;
	uint32_t count = 0;

	if (SDIO_GetResponse(SDIO_RESP1) & SD_CARD_LOCKED) {
		errorstatus = SD_LOCK_UNLOCK_FAILED;
		return(errorstatus);
	}

	/* Set block size for card if it is not equal to current block size for card. */
	SDIO_CmdInitStructure.SDIO_Argument = 64;
	SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SET_BLOCKLEN;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommand(&SDIO_CmdInitStructure);

	errorstatus = CmdResp1Error(SDIO_SET_BLOCKLEN);

	if (errorstatus != SD_OK) {
		return(errorstatus);
	}

	/* CMD55 */
	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) RCA << 16;
	SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_APP_CMD;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommand(&SDIO_CmdInitStructure);
	errorstatus = CmdResp1Error(SDIO_APP_CMD);

	if (errorstatus != SD_OK) {
		return(errorstatus);
	}

	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
	SDIO_DataInitStructure.SDIO_DataLength = 64;
	SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_64b;
	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
	SDIO_DataConfig(&SDIO_DataInitStructure);

	/* Send ACMD13 SD_APP_STAUS  with argument as card's RCA.*/
	SDIO_CmdInitStructure.SDIO_Argument = 0;
	SDIO_CmdInitStructure.SDIO_CmdIndex = SDIO_SD_APP_STAUS;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommand(&SDIO_CmdInitStructure);
	errorstatus = CmdResp1Error(SDIO_SD_APP_STAUS);

	if (errorstatus != SD_OK) {
		return(errorstatus);
	}

	while (!(SDIO->STA &(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR))) {
		if (SDIO_GetFlagStatus(SDIO_FLAG_RXFIFOHF) != RESET) {
			for (count = 0; count < 8; count++) {
				*(psdstatus + count) = SDIO_ReadData();
			}
			psdstatus += 8;
		}
	}

	if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET) {
		SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
		errorstatus = SD_DATA_TIMEOUT;
		return(errorstatus);
	} else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET) {
		SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
		errorstatus = SD_DATA_CRC_FAIL;
		return(errorstatus);
	} else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET) {
		SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
		errorstatus = SD_RX_OVERRUN;
		return(errorstatus);
	} else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET) {
		SDIO_ClearFlag(SDIO_FLAG_STBITERR);
		errorstatus = SD_START_BIT_ERR;
		return(errorstatus);
	}

	while (SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET) {
		*psdstatus = SDIO_ReadData();
		psdstatus++;
	}

	/* Clear all the static status flags*/
	SDIO_ClearFlag(SDIO_STATIC_FLAGS);
	psdstatus -= 16;
	for (count = 0; count < 16; count++) {
		psdstatus[count] = ((psdstatus[count] & SD_0TO7BITS) << 24) |((psdstatus[count] & SD_8TO15BITS) << 8) |
						   ((psdstatus[count] & SD_16TO23BITS) >> 8) |((psdstatus[count] & SD_24TO31BITS) >> 24);
	}
	return(errorstatus);
}

/**
  * @brief  Allows to process all the interrupts that are high.
  * @param  None
  * @retval SD_Error: SD Card Error code.
  */
SD_Error SD_ProcessIRQSrc(void)
{
	uint32_t count = 0, restwords = 0;

	if (DeviceMode == SD_INTERRUPT_MODE) {
		if (SDIO_GetITStatus(SDIO_IT_RXFIFOHF) != RESET) {
			for (count = 0; count < SD_HALFFIFO; count++) {
				*(DestBuffer + count) = SDIO_ReadData();
			}
			DestBuffer += SD_HALFFIFO;
			NumberOfBytes += SD_HALFFIFOBYTES;
		} else if (SDIO_GetITStatus(SDIO_IT_TXFIFOHE) != RESET) {
			if ((TotalNumberOfBytes - NumberOfBytes) < SD_HALFFIFOBYTES) {
				restwords = ((TotalNumberOfBytes - NumberOfBytes) %  4 == 0) ?
							((TotalNumberOfBytes - NumberOfBytes) / 4) :
							((TotalNumberOfBytes - NumberOfBytes) / 4 + 1);

				for (count = 0; count < restwords;  count++, SrcBuffer++, NumberOfBytes += 4) {
					SDIO_WriteData(*SrcBuffer);
				}
			} else {
				for (count = 0; count < SD_HALFFIFO; count++) {
					SDIO_WriteData(*(SrcBuffer + count));
				}

				SrcBuffer += SD_HALFFIFO;
				NumberOfBytes += SD_HALFFIFOBYTES;
			}
		}
	}

	if (SDIO_GetITStatus(SDIO_IT_DATAEND) != RESET) {
		if (DeviceMode != SD_DMA_MODE) {
			while ((SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET)  &&  (NumberOfBytes < TotalNumberOfBytes)) {
				*DestBuffer = SDIO_ReadData();
				DestBuffer++;
				NumberOfBytes += 4;
			}
		}

		if (StopCondition == 1) {
			TransferError = SD_StopTransfer();
		} else {
			TransferError = SD_OK;
		}
		SDIO_ClearITPendingBit(SDIO_IT_DATAEND);
		SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND |
					  SDIO_IT_TXFIFOHE | SDIO_IT_RXFIFOHF | SDIO_IT_TXUNDERR |
					  SDIO_IT_RXOVERR | SDIO_IT_STBITERR, DISABLE);
		TransferEnd = 1;
		NumberOfBytes = 0;
		return(TransferError);
	}

	if (SDIO_GetITStatus(SDIO_IT_DCRCFAIL) != RESET) {
		SDIO_ClearITPendingBit(SDIO_IT_DCRCFAIL);
		SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND |
					  SDIO_IT_TXFIFOHE | SDIO_IT_RXFIFOHF | SDIO_IT_TXUNDERR |
					  SDIO_IT_RXOVERR | SDIO_IT_STBITERR, DISABLE);
		NumberOfBytes = 0;
		TransferError = SD_DATA_CRC_FAIL;
		return(SD_DATA_CRC_FAIL);
	}

	if (SDIO_GetITStatus(SDIO_IT_DTIMEOUT) != RESET) {
		SDIO_ClearITPendingBit(SDIO_IT_DTIMEOUT);
		SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND |
					  SDIO_IT_TXFIFOHE | SDIO_IT_RXFIFOHF | SDIO_IT_TXUNDERR |
					  SDIO_IT_RXOVERR | SDIO_IT_STBITERR, DISABLE);
		NumberOfBytes = 0;
		TransferError = SD_DATA_TIMEOUT;
		return(SD_DATA_TIMEOUT);
	}

