donginhb/yeejoin-workspace/light-300/rs485-sw/os-app/bsp/stm32f10x/sdcard.c
/*
 * RT-Thread SD Card Driver
 * 20100715 Bernard support SDHC card great than 4G.
 */
#include <rtthread.h>
#include <dfs_fs.h>

/* set sector size to 512 */
#define SECTOR_SIZE		512

static struct rt_device sdcard_device;
static SD_CardInfo SDCardInfo;
static struct dfs_partition part;
static struct rt_semaphore sd_lock;
static rt_uint8_t _sdcard_buffer[SECTOR_SIZE];

struct dfs_partition bootpart_info;

/* RT-Thread Device Driver Interface */
static rt_err_t rt_sdcard_init(rt_device_t dev)
{
	NVIC_InitTypeDef NVIC_InitStructure;

	NVIC_InitStructure.NVIC_IRQChannel = SDIO_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = SDIO_PREEMPTION_PRI;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = SDIO_SUB_PRI;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	if (rt_sem_init(&sd_lock, "sdlock", 1, RT_IPC_FLAG_FIFO) != RT_EOK) {
		rt_kprintf("init sd lock semaphore failed\n");
	}

	return RT_EOK;
}

static rt_err_t rt_sdcard_open(rt_device_t dev, rt_uint16_t oflag)
{
	return RT_EOK;
}

static rt_err_t rt_sdcard_close(rt_device_t dev)
{
	return RT_EOK;
}

static rt_size_t rt_sdcard_read(rt_device_t dev, rt_off_t pos, void* buffer, rt_size_t size)
{
	SD_Error status;
	rt_uint32_t retry;
	rt_uint32_t factor;

#if 0
	if (CardType == SDIO_HIGH_CAPACITY_SD_CARD) factor = 1;
	else factor = SECTOR_SIZE;
#else
	factor = SECTOR_SIZE;
#endif
	rt_sem_take(&sd_lock, RT_WAITING_FOREVER);

	retry = 3;
	while(retry) {
		/* read all sectors */
		if (((rt_uint32_t)buffer % 4 != 0) ||
			((rt_uint32_t)buffer > 0x20080000)) {
			rt_uint32_t index;

			/* which is not alignment with 4 or chip SRAM */
			for (index = 0; index < size; index ++) {
				status = SD_ReadBlock((part.offset + index + pos) * factor,
									  (uint32_t*)_sdcard_buffer, SECTOR_SIZE);

				if (status != SD_OK) break;

				/* copy to the buffer */
				rt_memcpy(((rt_uint8_t*)buffer + index * SECTOR_SIZE), _sdcard_buffer, SECTOR_SIZE);
			}
		} else {
			if (size == 1) {
				status = SD_ReadBlock((part.offset + pos) * factor,
									  (uint32_t*)buffer, SECTOR_SIZE);
			} else {
				status = SD_ReadMultiBlocks((part.offset + pos) * factor,
											(uint32_t*)buffer, SECTOR_SIZE, size);
			}
		}

		if (status == SD_OK) break;

		retry --;
	}
	rt_sem_release(&sd_lock);

	if (status == SD_OK) return size;

	rt_kprintf("read failed: %d, buffer 0x%08x\n", status, buffer);
	return 0;
}

static rt_size_t rt_sdcard_write (rt_device_t dev, rt_off_t pos, const void* buffer, rt_size_t size)
{
	SD_Error status;
	rt_uint32_t factor;

#if 0
	if (CardType == SDIO_HIGH_CAPACITY_SD_CARD) factor = 1;
	else factor = SECTOR_SIZE;
#else
	factor = SECTOR_SIZE;
#endif

	rt_sem_take(&sd_lock, RT_WAITING_FOREVER);

	/* read all sectors */
	if (((rt_uint32_t)buffer % 4 != 0) ||
		((rt_uint32_t)buffer > 0x20080000)) {
		rt_uint32_t index;

		/* which is not alignment with 4 or not chip SRAM */
		for (index = 0; index < size; index ++) {
			/* copy to the buffer */
			rt_memcpy(_sdcard_buffer, ((rt_uint8_t*)buffer + index * SECTOR_SIZE), SECTOR_SIZE);

			status = SD_WriteBlock((part.offset + index + pos) * factor,
								   (uint32_t*)_sdcard_buffer, SECTOR_SIZE);

			if (status != SD_OK) break;
		}
	} else {
		if (size == 1) {
			status = SD_WriteBlock((part.offset + pos) * factor,
								   (uint32_t*)buffer, SECTOR_SIZE);
		} else {
			status = SD_WriteMultiBlocks((part.offset + pos) * factor,
										 (uint32_t*)buffer, SECTOR_SIZE, size);
		}
	}

	rt_sem_release(&sd_lock);

	if (status == SD_OK) return size;

	rt_kprintf("write failed: %d, buffer 0x%08x\n", status, buffer);
	return 0;
}

static rt_err_t rt_sdcard_control(rt_device_t dev, rt_uint8_t cmd, void *args)
{
	RT_ASSERT(dev != RT_NULL);

	if (cmd == RT_DEVICE_CTRL_BLK_GETGEOME) {
		struct rt_device_blk_geometry *geometry;

		geometry = (struct rt_device_blk_geometry *)args;
		if (geometry == RT_NULL) return -RT_ERROR;

		geometry->bytes_per_sector = 512;
		geometry->block_size = SDCardInfo.CardBlockSize;
		if (CardType == SDIO_HIGH_CAPACITY_SD_CARD)
			geometry->sector_count = (SDCardInfo.SD_csd.DeviceSize + 1)  * 1024;
		else
			geometry->sector_count = SDCardInfo.CardCapacity/SDCardInfo.CardBlockSize;
	}

	return RT_EOK;
}

void rt_hw_sdcard_init()
{
	if (SD_Init() == SD_OK) {
		SD_Error status;
		rt_uint8_t *sector;

		rt_kprintf("sd init succ\n");

		status = SD_GetCardInfo(&SDCardInfo);
		if (status != SD_OK) goto ret_err;

		status = SD_SelectDeselect((u32) (SDCardInfo.RCA << 16));
		if (status != SD_OK) goto ret_err;

		SD_EnableWideBusOperation(SDIO_BusWide_4b);
		SD_SetDeviceMode(SD_DMA_MODE);

		/* get the first sector to read partition table */
		sector = (rt_uint8_t*) rt_malloc(512);
		if (sector == RT_NULL) {
			rt_kprintf("allocate partition sector buffer failed\n");
			return;
		}
		status = SD_ReadBlock(0, (uint32_t*)sector, 512);
		if (status == SD_OK) {
			/* get the first partition */
			if (dfs_filesystem_get_partition(&part, sector, 0) != RT_EOK) {
				/* there is no partition */
				part.offset = 0;
				part.size   = 0;
			}

			if (dfs_filesystem_get_partition(&bootpart_info, sector, 1) != RT_EOK) {/* add by David */
				rt_kprintf("Get boot partition info failed!\n");
			}
		} else {
			/* there is no partition table */
			part.offset = 0;
			part.size   = 0;
		}

		/* release sector buffer */
		rt_free(sector);

		/* register sdcard device */
		sdcard_device.type  	= RT_Device_Class_Block;
		sdcard_device.init 	= rt_sdcard_init;
		sdcard_device.open 	= rt_sdcard_open;
		sdcard_device.close 	= rt_sdcard_close;
		sdcard_device.read 	= rt_sdcard_read;
		sdcard_device.write 	= rt_sdcard_write;
		sdcard_device.control	= rt_sdcard_control;

		/* no private */
		sdcard_device.user_data = &SDCardInfo;

		rt_device_register(&sdcard_device, "sd0",
						   RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_REMOVABLE | RT_DEVICE_FLAG_STANDALONE);

		return;
	}

ret_err:
	rt_kprintf("sdcard init failed\n");

	return;
}


#if 1
#include <finsh.h>

int conver_512blk_to_KMGB(unsigned long size_bytes, char *buf, int len)
{
	unsigned int part_size;

	if ((size_bytes>>11) > 0) { /* MB */
		part_size = size_bytes >> 11;/* MB */
		if ((part_size>>10) > 0)
			rt_snprintf(buf, len, "%d.%d%s", part_size>>10, (part_size&0x3FF)*1000/1024,       "GB"); /* GB */
		else
			rt_snprintf(buf, len, "%d.%d%s", part_size,     ((size_bytes>>1)&0x3FF)*1000/1024, "MB"); /* MB */
	} else {
		rt_snprintf(buf, len, "%d%s",size_bytes>>1,"KB"); /* KB */
	}

