donginhb/yeejoin-workspace/light-300/rs485-sw/os-app/bsp/stm32f10x/sdcard.c
	return 0;
}


void print_sdinfo(void)
{
	char buf[16];

	conver_512blk_to_KMGB(SDCardInfo.CardCapacity>>9, buf, sizeof(buf));
	buf[15] = 0;

	printf_syn("capacit:%u(%s), blocksize:%u, rca:%u, cardtype:%u\n",
			   SDCardInfo.CardCapacity, buf, SDCardInfo.CardBlockSize, SDCardInfo.RCA, SDCardInfo.CardType);

	printf_syn("CSD info:\n\t\tCSDStruct		:%5u, SysSpecVersion	\t:%5u, Reserved1		:%5u,\n\
		TAAC			:%5u, NSAC		\t:%5u, MaxBusClkFrec	\t:%5u,\n\
		CardComdClasses		:%5u, RdBlockLen	\t:%5u, PartBlockRead	\t:%5u,\n\
		WrBlockMisalign		:%5u, RdBlockMisalign	\t:%5u, DSRImpl		\t:%5u,\n\
		Reserved2		:%5u, DeviceSize	\t:%5u, MaxRdCurrentVDDMin\t:%5u,\n\
		MaxRdCurrentVDDMax	:%5u, MaxWrCurrentVDDMin\t:%5u, MaxWrCurrentVDDMax\t:%5u,\n",
			   SDCardInfo.SD_csd.CSDStruct		,SDCardInfo.SD_csd.SysSpecVersion	,SDCardInfo.SD_csd.Reserved1		,
			   SDCardInfo.SD_csd.TAAC			,SDCardInfo.SD_csd.NSAC			,SDCardInfo.SD_csd.MaxBusClkFrec	,
			   SDCardInfo.SD_csd.CardComdClasses	,SDCardInfo.SD_csd.RdBlockLen		,SDCardInfo.SD_csd.PartBlockRead	,
			   SDCardInfo.SD_csd.WrBlockMisalign	,SDCardInfo.SD_csd.RdBlockMisalign	,SDCardInfo.SD_csd.DSRImpl		,
			   SDCardInfo.SD_csd.Reserved2		,SDCardInfo.SD_csd.DeviceSize		,SDCardInfo.SD_csd.MaxRdCurrentVDDMin	,
			   SDCardInfo.SD_csd.MaxRdCurrentVDDMax	,SDCardInfo.SD_csd.MaxWrCurrentVDDMin	,SDCardInfo.SD_csd.MaxWrCurrentVDDMax);

	printf_syn("\t\tDeviceSizeMul		:%5u, EraseGrSize	\t:%5u, EraseGrMul	\t:%5u,\n\
		WrProtectGrSize		:%5u, WrProtectGrEnable	:%5u, ManDeflECC		:%5u,\n\
		WrSpeedFact		:%5u, MaxWrBlockLen	\t:%5u, WriteBlockPaPartia\t:%5u,\n\
		Reserved3		:%5u, ContentProtectAppl\t:%5u, FileFormatGrouop	:%5u,\n\
		CopyFlag		:%5u, PermWrProtect	\t:%5u, TempWrProtect	\t:%5u,\n\
		FileFormat		:%5u, ECC		\t:%5u, CSD_CRC		\t:%5u,\n\
		Reserved4		:%5u\n",
			   SDCardInfo.SD_csd.DeviceSizeMul		,SDCardInfo.SD_csd.EraseGrSize		,SDCardInfo.SD_csd.EraseGrMul		,
			   SDCardInfo.SD_csd.WrProtectGrSize	,SDCardInfo.SD_csd.WrProtectGrEnable	,SDCardInfo.SD_csd.ManDeflECC		,
			   SDCardInfo.SD_csd.WrSpeedFact		,SDCardInfo.SD_csd.MaxWrBlockLen	,SDCardInfo.SD_csd.WriteBlockPaPartial	,
			   SDCardInfo.SD_csd.Reserved3		,SDCardInfo.SD_csd.ContentProtectAppli	,SDCardInfo.SD_csd.FileFormatGrouop	,
			   SDCardInfo.SD_csd.CopyFlag		,SDCardInfo.SD_csd.PermWrProtect	,SDCardInfo.SD_csd.TempWrProtect	,
			   SDCardInfo.SD_csd.FileFormat		,SDCardInfo.SD_csd.ECC			,SDCardInfo.SD_csd.CSD_CRC		,
			   SDCardInfo.SD_csd.Reserved4);

	printf_syn("CID info:\n\t\tManufacturerID	:%5u, OEM_AppliID   	:%5u, ProdName1	:%5u,\n\
		ProdName2	:%5u, ProdRev		:%5u, ProdSN	\t:%5u,\n\
		Reserved1	:%5u, ManufactDate	:%5u, CID_CRC	\t:%5u,\n\
		Reserved2	:%5u\n",
			   SDCardInfo.SD_cid.ManufacturerID, SDCardInfo.SD_cid.OEM_AppliID , SDCardInfo.SD_cid.ProdName1	,
			   SDCardInfo.SD_cid.ProdName2	, SDCardInfo.SD_cid.ProdRev	, SDCardInfo.SD_cid.ProdSN	,
			   SDCardInfo.SD_cid.Reserved1	, SDCardInfo.SD_cid.ManufactDate, SDCardInfo.SD_cid.CID_CRC	,
			   SDCardInfo.SD_cid.Reserved2);

	return;
}
FINSH_FUNCTION_EXPORT(print_sdinfo, print sdcard info);


void print_partinfo(void)
{
	SD_Error status;
	rt_uint8_t *sector;
	struct dfs_partition partinfo[4];
	int i;

	/* get the first sector to read partition table */
	sector = (rt_uint8_t*) rt_malloc(512);
	if (sector == RT_NULL) {
		rt_kprintf("allocate partition sector buffer failed\n");
		return;
	}

	status = SD_ReadBlock(0, (uint32_t*)sector, 512);
	if (status == SD_OK) {
		for (i=0; i<4; ++i) {
			if (dfs_filesystem_get_partition(partinfo+i, sector, i) != RT_EOK)
				printf_syn("read %dth partition info fail\n", i);
			else
				printf_syn("[%d partition]type:%u, offset:%d, size:%u\n",
						   i, partinfo[i].type, partinfo[i].offset, partinfo[i].size);
		}
	} else {
		printf_syn("read 0 block fail\n");
	}

	/* release sector buffer */
	rt_free(sector);

}

FINSH_FUNCTION_EXPORT(print_partinfo, print partition info);


#endif

#define SDCARD_SECTOR_SIZE	512

/*
 * buf -- must 4 bytes alignment
 */
int sdcard_read_data4bootpart(unsigned long addr, unsigned char *buf, unsigned long len)
{
	unsigned char *ps, *pd;
	SD_Error status;
	int ret;

	if (0==bootpart_info.offset || (NULL==buf)) {
		printf_syn("not found boot partition or rbuffer is null\n");
		return FAIL;
	}

	if (0 == len)
		return SUCC;

	rt_sem_take(&sd_lock, RT_WAITING_FOREVER);
	ret = SUCC;

	while (len >= SDCARD_SECTOR_SIZE) {
		status = SD_ReadBlock(addr, (uint32_t *)buf, SDCARD_SECTOR_SIZE);
		if (status == SD_OK) {
			addr += SDCARD_SECTOR_SIZE;
			buf  += SDCARD_SECTOR_SIZE;
			len  -= SDCARD_SECTOR_SIZE;
		} else {
			printf_syn("Read sector of sdcard failed(%d)\n", status);
			ret = FAIL;
			goto ret_entry;
		}
	}

	if (0 != len) {
		status = SD_ReadBlock(addr, (uint32_t *)_sdcard_buffer, SDCARD_SECTOR_SIZE);
		if (status == SD_OK) {
			ps = (unsigned char *)_sdcard_buffer;
			pd = buf;
			while (len-- > 0)
				*pd++ = *ps++;
		} else {
			printf_syn("read sector of sdcard failed(%d)\n", status);
			ret = FAIL;
		}
	}

ret_entry:
	rt_sem_release(&sd_lock);

	return ret;
}

/*
 * buf -- must 4 bytes alignment
 */
int sdcard_write_data_by_sector4bootpart(unsigned long addr, unsigned char *buf, unsigned long len)
{
	SD_Error status;
	unsigned char *ps, *pd;
	int ret;

	if (0==bootpart_info.offset || (NULL==buf) || (addr & (SDCARD_SECTOR_SIZE-1))) {
		printf_syn("not found boot partition or wbuffer is null, addr(0x%x)\n", addr);
		return FAIL;
	}

	if (0 == len)
		return SUCC;

	rt_sem_take(&sd_lock, RT_WAITING_FOREVER);
	ret = SUCC;

	while (len >= SDCARD_SECTOR_SIZE) {
		status = SD_WriteBlock(addr, (uint32_t *)buf, SDCARD_SECTOR_SIZE);
		if (status == SD_OK) {
			addr += SDCARD_SECTOR_SIZE;
			buf  += SDCARD_SECTOR_SIZE;
			len  -= SDCARD_SECTOR_SIZE;
		} else {
			printf_syn("Write sector of sdcard failed(%d), addr:0x%x\n", status, addr);
			ret = FAIL;
			goto ret_entry;
		}
	}

	if (0 != len) {
		rt_memset(_sdcard_buffer, 0, sizeof(_sdcard_buffer));
		pd = (unsigned char *)_sdcard_buffer;
		ps = buf;
		while (len-- > 0)
			*pd++ = *ps++;

		status = SD_WriteBlock(addr, (uint32_t *)_sdcard_buffer, SDCARD_SECTOR_SIZE);
		if (SD_OK != status) {
			printf_syn("write sector of sdcard failed(%d), addr:0x%x\n", status, addr);
			ret = FAIL;
			goto ret_entry;
		}
	}

ret_entry:
	rt_sem_release(&sd_lock);

	return ret;
}

